In [1]:
import pandas as pd
import numpy as np

In [6]:
#creating dataframe
my_df = pd.DataFrame()
print(my_df)

Empty DataFrame
Columns: []
Index: []

In [19]:
# creating DataFrame with list of lists
score = [['math', 85], ["Eng", 68], ["History", 66]]
my_df = pd.DataFrame(score, columns = ['Subject', 'Mark'])
my_df

<zip object at 0x000001A77D342F40>

In [8]:
# creating DataFrame with Dictionary
score = {'Subject': ['math', 'history', 'English', 'Science', 'Arts'],
        'score': [80, 60, 56, 77, 65]}
my_df = pd.DataFrame(score)
my_df

   Subject  score
0     math     80
1  history     60
2  English     56
3  Science     77
4     Arts     65

In [16]:
# return lower 2 colunms
my_df.tail(2)

   Subject  score
3  Science     77
4     Arts     65

In [14]:
# return top 2 colunms
my_df.head(2)

   Subject  score
0     math     80
1  history     60

In [17]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Subject  5 non-null      object
 1   score    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [18]:
my_df.describe()

           score
count   5.000000
mean   67.600000
std    10.502381
min    56.000000
25%    60.000000
50%    65.000000
75%    77.000000
max    80.000000

In [21]:
scores = {'Subject':["Mathematics", "History", "English", "Science", "Arts"],
'Score':[ 98 , 75 , 68 , 82 , 99 ]
}

print(zip(scores, score))

<zip object at 0x000001A77D362840>